//ZATLAS1C JOB (12345678),ZATLAS1,MSGCLASS=H,REGION=0M,
//        MSGLEVEL=(1,1),CLASS=A,NOTIFY=&SYSUID
//*******************************************************               00690006
//RUNIT1O EXEC PGM=IRXJCL,PARM='RXPCSUBA',COND=(0,NE)                   00700006
//STEPLIB  DD  DISP=SHR,DSN=ZATLAS1.PCRE2.LOADLIB                       00730000
//SYSEXEC  DD  DISP=SHR,DSN=ZATLAS1.PCRE2.CNTLLIB                       00740000
//SYSIN    DD  *                                                        00750000
//SYSPRINT DD  SYSOUT=*                                                 00760000
//SYSTSPRT DD  SYSOUT=*                                                 00770000
//PCREDUMP DD  SYSOUT=*                                                 00780006
//*PCREDUMP DD  DISP=MOD,DSN=ZATLAS1.REXX.OUTPUTO                       00780006
