         MACRO                                                          00000050
         STKINS &P1,&P2,&P3,&P4,&P5,&P6                                 00000100
         COPY  GBLVARS                                                  00000150
         LCLC  &SIGN                                                    00000200
.*
.* AUGUST 2014 - JOHN GATELEY - ADD SUPPORT FOR TAM AND TP
.*
         AIF    ('&P1(2)' EQ '').NOTSUBL                                00000250
           AIF ('&P1(6)' EQ '' OR '&P1(6)' EQ '&LIND(&LI)').OKSUBL      00000300
             MNOTE 12,'TOO MANY OPERANDS INSIDE PARENTHESES'            00000350
             MEXIT                                                      00000400
.OKSUBL  AIF   ('&P1(1)' EQ 'TP').TPST                                  00002700
         AIF   ('&P1(1)' EQ 'TAM').TAM24                                00002700
         AIF   ('&P1(3)' EQ '').FILE                                    00000450
         PUSHINS (&P1(1),&P1(2),&P1(3),&P1(4),&P1(5),&P1(6))            00000500
             MEXIT                                                      00000550
.NOTSUBL AIF   ('&P2' EQ '' OR '&P2' EQ 'OR' OR '&P2' EQ 'AND' OR '&P2'X00000600
               EQ 'ORIF' OR '&P2' EQ 'ANDIF').SGLOPR                    00000650
           AIF ('&P5' EQ 'OR' OR '&P5' EQ 'AND' OR '&P5' EQ 'ORIF' OR  X00000700
               '&P5' EQ 'ANDIF').TWOPER2                                00000750
             PUSHINS (&P1,&P2,&P3,&P4,&P5,&P6)                          00000800
&CTR         SETA  &CTR+4                                               00000850
             MEXIT                                                      00000900
.TWOPER2   PUSHINS (&P1,&P2,&P3,&P4,,&P6)                               00000950
&CTR         SETA  &CTR+3                                               00001000
             MEXIT                                                      00001050
.FILE    AIF   ('&P1(1)'(1,1) EQ '(').FILE1                             00001100
&SIGN    SETC  '+'                                                      00001150
.FILE1   AIF   ('&P1(2)' NE 'OPEN').FILE2                               00001200
         PUSHINS (TM,X'30'&SIGN&P1(1),X'10',O,&P1(5),&P1(6))            00001250
         MEXIT                                                          00001300
.FILE2   AIF   ('&P1(2)' NE 'NOTOPEN').FILE3                            00001350
         PUSHINS (TM,X'30'&SIGN&P1(1),X'10',Z,&P1(5),&P1(6))            00001400
         MEXIT                                                          00001450
.FILE3   AIF   ('&P1(2)' NE 'EOF').FILE4                                00001500
         PUSHINS (TM,X'30'&SIGN&P1(1),X'04',O,&P1(5),&P1(6))            00001550
         MEXIT                                                          00001600
.FILE4   AIF   ('&P1(2)' NE 'NOTEOF').FILE5                             00001650
         PUSHINS (TM,X'30'&SIGN&P1(1),X'04',Z,&P1(5),&P1(6))            00001700
         MEXIT                                                          00001750
.FILE5   AIF   ('&P1(2)' NE 'ENDPROG').FILE6                            00001800
         PUSHINS (CLC,&P1(1),NE,=F'-1',&P1(5),&P1(6))                   00001850
         MEXIT                                                          00001900
.FILE6   AIF   ('&P1(2)' NE 'NOTENDPROG').FILE7                         00001950
         PUSHINS (CLC,&P1(1),EQ,=F'-1',&P1(5),&P1(6))                   00002000
         MEXIT                                                          00002050
.FILE7   AIF   ('&P1(2)' NE 'INERROR').FILE8                            00002100
         PUSHINS (CLC,&P1(1),NE,=F'0',&P1(5),&P1(6))                    00002150
         MEXIT                                                          00002200
.FILE8   AIF   ('&P1(2)' NE 'NOTINERROR').FILE9                         00002250
         PUSHINS (CLC,&P1(1),EQ,=F'0',&P1(5),&P1(6))                    00002300
         MEXIT                                                          00002350
.FILE9   AIF   ('&P1(2)' NE 'SYNAD').FILE10                             00002400
         PUSHINS (TM,X'2C'&SIGN&P1(1),X'30',O,&P1(5),&P1(6))            00002450
         MEXIT                                                          00002500
.FILE10  AIF   ('&P1(2)' NE 'NOTSYNAD').FILE11                          00002550
         PUSHINS (TM,X'2C'&SIGN&P1(1),X'30',Z,&P1(5),&P1(6))            00002600
         MEXIT                                                          00002650
.FILE11  ANOP                                                           00002700
         PUSHINS (TM,0(0),X'00',O,&P1(5),&P1(6))                        00002750
         MNOTE 12,'INVALID INSTRUCTION &P1(1),&P1(2) - NOP GENERATED'   00002800
         MEXIT                                                          00002850
.*
.TPST    ANOP                                                           00002700
         PUSHINS (&P1(1),&P1(2),,&P1(3))                                00002750
         MEXIT                                                          00002650
.*
.TAM24   AIF   ('&P1(2)' NE '24').TAM31                                 00002700
         PUSHINS (&P1(1),*24,,8)                                        00002750
         MEXIT                                                          00002650
.TAM31   AIF   ('&P1(2)' NE '31').TAM64                                 00002700
         PUSHINS (&P1(1),*31,,4)                                        00002750
         MEXIT                                                          00002650
.TAM64   AIF   ('&P1(2)' NE '64').TAMERR                                00002700
         PUSHINS (&P1(1),*64,,1)                                        00002750
         MEXIT                                                          00002650
.TAMERR  ANOP                                                           00002700
         MNOTE 12,'TAM CAN ONLY TEST 24 31 OR 64'                       00002800
         MEXIT                                                          00002850
.*
.SGLOPR  GETCC  &P1(1)                                                  00002900
         MEND                                                           00002950
